[
	"Conditions of Worth: a child will only receive praise, love, etc from it's parents if it behaves in ways that are considered by them as socially acceptable #humanistic",
	"Maslow's hierachy of needs: A pyrimaid which has all of the items we need to acheive self-actualisation (acheiving individual potential). From bottom to top: Physiological, Safety, Love/Belonging, Esteem, Self-actualisation #humanistic",
	"Defence Mechenaisms: used to settle the conflict between the id and superego, to keep the ego at peace. Some of which are Denial, Displacement (directing from dangerous object to safe object, i.e punching a pillow), Rationalisation (a drunk person saying they are drinking for health benifits), sublmination (a voilent person joining the army) #psychodynamic",	
	"Rat Man: Freud saw him for about a year. He was obsessive and fearful of rats. When he was in the army he heard of a nasty treatment were a bucket of rats were placed on someones anus and they would eat their way into a person via this. Freud said that this resulted from the unconcious hate for his father, whom he wished to torture with rats #research #psychodynamic",
	"Psychosexual Stages: Oral, Anal, Phaliic, Latent, Genital #psychodynamic",
	"Information Processing Approach: Like a computer we encode, store/transform infromation and then provide an output or behaviour. Example: Bob sees the shuttlecock coming towards him (encoding), he decides to play a forehand shot (processing) and then hits the shuttlecock (output) #cognitive",
	"Computational and Connectionist models: When highlihited nodes are activated, they may represent a learned concept. Example: Bark sound, paws, fur may mean Dog (in a simple form) #cognitive",
	"Evaluation of Cognitive: Positive: <ul><li>Focuses on internal mental processes unlike behaviour</li><li>The approach uses scientific, experimental methods unlike humanisitic</li><li>Models such as information-procssing approach have been used to effectively explain mental processes</li></ul> Negative: <ul><li>Over simplistic and ignoring complexities of the mind</li><li>Crude comparrison of the mind to a computer. WE ARE NOT MACHINES</li><li>Most experiments are lab, lack of ecological validity</li></ul>",
	"Evaluation of Psychodynamic approach: Positive: <ul><li>Freud acknologed the importance of childhood experiences</li><li>Provides causual explainations for psychological conditions</li><li>Psychoanalysis is still used today</li></ul>Negative:<ul><li>Unfalsifiable (like humanistic) and therefore unscientific</li><li>Case studies cannot be generalised and that's all he used</li><li>Idea of infants with sexual urges isn't socially accepted</li><li>Effectivenness of psychoanalysis is questionalbe</li></ul>",
	"Evaluation of humanistic. Positive: <ul><li>People are active agents and control/determin our own behaviour unlike behaviourism</li><li>Not determinisitic, freewill. Personal responsibility</li><li>Subjective experience of a person is of value and importance</li><li>PCT/Counselling is still used today</li></ul>Negative:<ul><li>Humanistic theories are hard to falsify, lack predictive power. Unscientific</li><li>Lack Empirical support</li><li>Over emphasise the person's ability to change and develop, ignore cultural constriants.</li><li>Individual emotions and consciounesss are difficult to study objectively</li></ul>"
]
